; ModuleID = 'MatrixMult_transpose.c'
source_filename = "MatrixMult_transpose.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.Matrix = type { i64*, i64, i64, i64 }

@.str.1 = private unnamed_addr constant [7 x i8] c" data:\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c" width:\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"%lld\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c" height:\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1
@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [5 x i8] c"fail\00", align 1

; Function Attrs: nounwind uwtable
define noalias %struct.Matrix* @copy_Matrix(%struct.Matrix* nocapture readonly %_Matrix) local_unnamed_addr #0 !dbg !8 {
entry:
  tail call void @llvm.dbg.value(metadata %struct.Matrix* %_Matrix, i64 0, metadata !23, metadata !25), !dbg !26
  %call = tail call noalias i8* @malloc(i64 32) #9, !dbg !27
  %0 = bitcast i8* %call to %struct.Matrix*, !dbg !29

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (http://llvm.org/git/clang.git f82fb5beb88e841f7a00cfb2a2ceabe46bcb2a9b) (http://llvm.org/git/llvm.git bafbf2b643f118fd2ea402ed6cd204281c7e9e94)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "MatrixMult_transpose.c", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/transpose/copyreduced_dealloc")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (http://llvm.org/git/clang.git f82fb5beb88e841f7a00cfb2a2ceabe46bcb2a9b) (http://llvm.org/git/llvm.git bafbf2b643f118fd2ea402ed6cd204281c7e9e94)"}
!8 = distinct !DISubprogram(name: "copy_Matrix", scope: !1, file: !1, line: 2, type: !9, isLocal: false, isDefinition: true, scopeLine: 2, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !22)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix", file: !13, line: 7, baseType: !14)
!13 = !DIFile(filename: "./MatrixMult_transpose.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/transpose/copyreduced_dealloc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 3, size: 256, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !14, file: !13, line: 4, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !14, file: !13, line: 4, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !14, file: !13, line: 5, baseType: !18, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !14, file: !13, line: 6, baseType: !18, size: 64, align: 64, offset: 192)
!22 = !{!23, !24}
!23 = !DILocalVariable(name: "_Matrix", arg: 1, scope: !8, file: !1, line: 2, type: !11)
!24 = !DILocalVariable(name: "new_Matrix", scope: !8, file: !1, line: 3, type: !11)
!25 = !DIExpression()
!26 = !DILocation(line: 2, column: 29, scope: !8)
!27 = !DILocation(line: 3, column: 23, scope: !28)
!28 = !DILexicalBlockFile(scope: !8, file: !1, discriminator: 1)
!29 = !DILocation(line: 3, column: 23, scope: !8)
!30 = !DILocation(line: 3, column: 10, scope: !8)
!31 = !DILocation(line: 4, column: 2, scope: !8)
!32 = !{!33, !37, i64 8}
!33 = !{!"", !34, i64 0, !37, i64 8, !37, i64 16, !37, i64 24}
!34 = !{!"any pointer", !35, i64 0}
!35 = !{!"omnipotent char", !36, i64 0}
!36 = !{!"Simple C/C++ TBAA"}
!37 = !{!"long long", !35, i64 0}
!38 = !{!33, !34, i64 0}
!39 = !DILocation(line: 5, column: 31, scope: !8)
!40 = !DILocation(line: 5, column: 14, scope: !8)
!41 = !{!37, !37, i64 0}
!42 = !DILocation(line: 5, column: 20, scope: !8)
!43 = !DILocation(line: 7, column: 2, scope: !8)
!44 = distinct !DISubprogram(name: "copy_array_Matrix", scope: !1, file: !1, line: 9, type: !45, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !48)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !47, !18}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!48 = !{!49, !50, !51, !52}
!49 = !DILocalVariable(name: "_Matrix", arg: 1, scope: !44, file: !1, line: 9, type: !47)
!50 = !DILocalVariable(name: "_Matrix_size", arg: 2, scope: !44, file: !1, line: 9, type: !18)
!51 = !DILocalVariable(name: "new_Matrix", scope: !44, file: !1, line: 10, type: !47)
!52 = !DILocalVariable(name: "i", scope: !53, file: !1, line: 11, type: !54)
!53 = distinct !DILexicalBlock(scope: !44, file: !1, line: 11, column: 2)
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = !DILocation(line: 9, column: 37, scope: !44)
!56 = !DILocation(line: 9, column: 56, scope: !44)
!57 = !DILocation(line: 10, column: 43, scope: !44)
!58 = !DILocation(line: 10, column: 24, scope: !59)
!59 = !DILexicalBlockFile(scope: !44, file: !1, discriminator: 1)
!60 = !DILocation(line: 10, column: 24, scope: !44)
!61 = !DILocation(line: 10, column: 11, scope: !44)
!62 = !DILocation(line: 11, column: 10, scope: !53)
!63 = !DILocation(line: 11, column: 15, scope: !64)
!64 = !DILexicalBlockFile(scope: !65, file: !1, discriminator: 1)
!65 = distinct !DILexicalBlock(scope: !53, file: !1, line: 11, column: 2)
!66 = !DILocation(line: 11, column: 2, scope: !64)
!67 = !DILocation(line: 12, column: 31, scope: !68)
!68 = distinct !DILexicalBlock(scope: !65, file: !1, line: 11, column: 33)
!69 = !DILocation(line: 14, column: 2, scope: !44)
!70 = !{!34, !34, i64 0}
!71 = !DILocation(line: 2, column: 29, scope: !8, inlinedAt: !72)
!72 = distinct !DILocation(line: 12, column: 19, scope: !68)
!73 = !DILocation(line: 3, column: 23, scope: !28, inlinedAt: !72)
!74 = !DILocation(line: 4, column: 2, scope: !8, inlinedAt: !72)
!75 = !DILocation(line: 5, column: 31, scope: !8, inlinedAt: !72)
!76 = !DILocation(line: 5, column: 14, scope: !8, inlinedAt: !72)
!77 = !DILocation(line: 5, column: 20, scope: !8, inlinedAt: !72)
!78 = !DILocation(line: 12, column: 3, scope: !68)
!79 = !DILocation(line: 12, column: 17, scope: !68)
!80 = distinct !{!80, !81}
!81 = !DILocation(line: 11, column: 2, scope: !44)
!82 = distinct !DISubprogram(name: "free_Matrix", scope: !1, file: !1, line: 16, type: !83, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !85)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !11}
!85 = !{!86}
!86 = !DILocalVariable(name: "matrix", arg: 1, scope: !82, file: !1, line: 16, type: !11)
!87 = !DILocation(line: 16, column: 26, scope: !82)
!88 = !DILocation(line: 17, column: 15, scope: !82)
!89 = !DILocation(line: 17, column: 2, scope: !82)
!90 = !DILocation(line: 18, column: 7, scope: !82)
!91 = !DILocation(line: 18, column: 2, scope: !82)
!92 = !DILocation(line: 19, column: 1, scope: !82)
!93 = distinct !DISubprogram(name: "printf_Matrix", scope: !1, file: !1, line: 20, type: !83, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !94)
!94 = !{!95}
!95 = !DILocalVariable(name: "matrix", arg: 1, scope: !93, file: !1, line: 20, type: !11)
!96 = !DILocation(line: 20, column: 28, scope: !93)
!97 = !DILocation(line: 21, column: 2, scope: !93)
!98 = !DILocation(line: 22, column: 2, scope: !93)
!99 = !DILocation(line: 23, column: 2, scope: !93)
!100 = !DILocation(line: 24, column: 2, scope: !93)
!101 = !DILocation(line: 25, column: 25, scope: !93)
!102 = !{!33, !37, i64 16}
!103 = !DILocation(line: 25, column: 2, scope: !93)
!104 = !DILocation(line: 26, column: 2, scope: !93)
!105 = !DILocation(line: 27, column: 25, scope: !93)
!106 = !{!33, !37, i64 24}
!107 = !DILocation(line: 27, column: 2, scope: !93)
!108 = !DILocation(line: 28, column: 2, scope: !93)
!109 = !DILocation(line: 29, column: 1, scope: !93)
!110 = distinct !DISubprogram(name: "matrix", scope: !1, file: !1, line: 30, type: !111, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !114)
!111 = !DISubroutineType(types: !112)
!112 = !{!11, !18, !18, !17, !18, !113}
!113 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123}
!115 = !DILocalVariable(name: "width", arg: 1, scope: !110, file: !1, line: 30, type: !18)
!116 = !DILocalVariable(name: "height", arg: 2, scope: !110, file: !1, line: 30, type: !18)
!117 = !DILocalVariable(name: "data", arg: 3, scope: !110, file: !1, line: 30, type: !17)
!118 = !DILocalVariable(name: "data_size", arg: 4, scope: !110, file: !1, line: 30, type: !18)
!119 = !DILocalVariable(name: "data_dealloc", arg: 5, scope: !110, file: !1, line: 30, type: !113)
!120 = !DILocalVariable(name: "r", scope: !110, file: !1, line: 31, type: !11)
!121 = !DILocalVariable(name: "r_dealloc", scope: !110, file: !1, line: 32, type: !113)
!122 = !DILocalVariable(name: "_4", scope: !110, file: !1, line: 33, type: !11)
!123 = !DILocalVariable(name: "_4_dealloc", scope: !110, file: !1, line: 34, type: !113)
!124 = !DILocation(line: 30, column: 26, scope: !110)
!125 = !DILocation(line: 30, column: 43, scope: !110)
!126 = !DILocation(line: 30, column: 51, scope: !110)
!127 = !DIExpression(DW_OP_bit_piece, 0, 1)
!128 = !DILocation(line: 30, column: 78, scope: !110)
!129 = !DILocation(line: 32, column: 2, scope: !110)
!130 = !DILocation(line: 34, column: 2, scope: !110)
!131 = !DILocation(line: 37, column: 7, scope: !110)
!132 = !DILocation(line: 33, column: 10, scope: !110)
!133 = !DILocation(line: 38, column: 2, scope: !110)
!134 = !DILocation(line: 39, column: 6, scope: !110)
!135 = !DILocation(line: 39, column: 13, scope: !110)
!136 = !DILocation(line: 40, column: 6, scope: !110)
!137 = !DILocation(line: 40, column: 12, scope: !110)
!138 = !DILocation(line: 46, column: 2, scope: !110)
!139 = distinct !DISubprogram(name: "init", scope: !1, file: !1, line: 50, type: !140, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !142)
!140 = !DISubroutineType(types: !141)
!141 = !{!11, !18, !18}
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!143 = !DILocalVariable(name: "width", arg: 1, scope: !139, file: !1, line: 50, type: !18)
!144 = !DILocalVariable(name: "height", arg: 2, scope: !139, file: !1, line: 50, type: !18)
!145 = !DILocalVariable(name: "r", scope: !139, file: !1, line: 51, type: !11)
!146 = !DILocalVariable(name: "r_dealloc", scope: !139, file: !1, line: 52, type: !113)
!147 = !DILocalVariable(name: "data", scope: !139, file: !1, line: 53, type: !17)
!148 = !DILocalVariable(name: "data_size", scope: !139, file: !1, line: 53, type: !18)
!149 = !DILocalVariable(name: "data_dealloc", scope: !139, file: !1, line: 54, type: !113)
!150 = !DILocalVariable(name: "i", scope: !139, file: !1, line: 55, type: !18)
!151 = !DILocalVariable(name: "j", scope: !139, file: !1, line: 56, type: !18)
!152 = !DILocalVariable(name: "_6", scope: !139, file: !1, line: 57, type: !18)
!153 = !DILocalVariable(name: "_7", scope: !139, file: !1, line: 58, type: !18)
!154 = !DILocalVariable(name: "_8", scope: !139, file: !1, line: 59, type: !17)
!155 = !DILocalVariable(name: "_8_size", scope: !139, file: !1, line: 59, type: !18)
!156 = !DILocalVariable(name: "_8_dealloc", scope: !139, file: !1, line: 60, type: !113)
!157 = !DILocalVariable(name: "_9", scope: !139, file: !1, line: 61, type: !18)
!158 = !DILocalVariable(name: "_10", scope: !139, file: !1, line: 62, type: !18)
!159 = !DILocalVariable(name: "_11", scope: !139, file: !1, line: 63, type: !18)
!160 = !DILocalVariable(name: "_12", scope: !139, file: !1, line: 64, type: !18)
!161 = !DILocalVariable(name: "_13", scope: !139, file: !1, line: 65, type: !18)
!162 = !DILocalVariable(name: "_14", scope: !139, file: !1, line: 66, type: !18)
!163 = !DILocalVariable(name: "_15", scope: !139, file: !1, line: 67, type: !18)
!164 = !DILocalVariable(name: "_16", scope: !139, file: !1, line: 68, type: !18)
!165 = !DILocalVariable(name: "_17", scope: !139, file: !1, line: 69, type: !18)
!166 = !DILocalVariable(name: "_18", scope: !139, file: !1, line: 70, type: !18)
!167 = !DILocalVariable(name: "_19", scope: !139, file: !1, line: 71, type: !18)
!168 = !DILocalVariable(name: "_20", scope: !139, file: !1, line: 72, type: !18)
!169 = !DILocalVariable(name: "_21", scope: !139, file: !1, line: 73, type: !11)
!170 = !DILocalVariable(name: "_21_dealloc", scope: !139, file: !1, line: 74, type: !113)
!171 = !DILocation(line: 50, column: 24, scope: !139)
!172 = !DILocation(line: 50, column: 41, scope: !139)
!173 = !DILocation(line: 52, column: 2, scope: !139)
!174 = !DILocation(line: 53, column: 2, scope: !139)
!175 = !DILocation(line: 54, column: 2, scope: !139)
!176 = !DILocation(line: 55, column: 12, scope: !139)
!177 = !DILocation(line: 56, column: 12, scope: !139)
!178 = !DILocation(line: 57, column: 12, scope: !139)
!179 = !DILocation(line: 58, column: 12, scope: !139)
!180 = !DILocation(line: 59, column: 2, scope: !139)
!181 = !DILocation(line: 60, column: 2, scope: !139)
!182 = !DILocation(line: 61, column: 12, scope: !139)
!183 = !DILocation(line: 62, column: 12, scope: !139)
!184 = !DILocation(line: 63, column: 12, scope: !139)
!185 = !DILocation(line: 64, column: 12, scope: !139)
!186 = !DILocation(line: 65, column: 12, scope: !139)
!187 = !DILocation(line: 66, column: 12, scope: !139)
!188 = !DILocation(line: 67, column: 12, scope: !139)
!189 = !DILocation(line: 68, column: 12, scope: !139)
!190 = !DILocation(line: 69, column: 12, scope: !139)
!191 = !DILocation(line: 70, column: 12, scope: !139)
!192 = !DILocation(line: 71, column: 12, scope: !139)
!193 = !DILocation(line: 72, column: 12, scope: !139)
!194 = !DILocation(line: 74, column: 2, scope: !139)
!195 = !DILocation(line: 78, column: 10, scope: !139)
!196 = !DILocation(line: 81, column: 2, scope: !139)
!197 = !DILocation(line: 94, column: 7, scope: !198)
!198 = distinct !DILexicalBlock(scope: !199, file: !1, line: 94, column: 6)
!199 = distinct !DILexicalBlock(scope: !139, file: !1, line: 92, column: 13)
!200 = !DILocation(line: 94, column: 6, scope: !199)
!201 = !DILocation(line: 30, column: 26, scope: !110, inlinedAt: !202)
!202 = distinct !DILocation(line: 141, column: 8, scope: !139)
!203 = !DILocation(line: 30, column: 43, scope: !110, inlinedAt: !202)
!204 = !DILocation(line: 30, column: 51, scope: !110, inlinedAt: !202)
!205 = !DILocation(line: 30, column: 78, scope: !110, inlinedAt: !202)
!206 = !DILocation(line: 32, column: 2, scope: !110, inlinedAt: !202)
!207 = !DILocation(line: 34, column: 2, scope: !110, inlinedAt: !202)
!208 = !DILocation(line: 37, column: 7, scope: !110, inlinedAt: !202)
!209 = !DILocation(line: 33, column: 10, scope: !110, inlinedAt: !202)
!210 = !DILocation(line: 38, column: 2, scope: !110, inlinedAt: !202)
!211 = !DILocation(line: 39, column: 6, scope: !110, inlinedAt: !202)
!212 = !DILocation(line: 39, column: 13, scope: !110, inlinedAt: !202)
!213 = !DILocation(line: 40, column: 6, scope: !110, inlinedAt: !202)
!214 = !DILocation(line: 40, column: 12, scope: !110, inlinedAt: !202)
!215 = !DILocation(line: 73, column: 10, scope: !139)
!216 = !DILocation(line: 148, column: 2, scope: !139)
!217 = !DILocation(line: 141, column: 8, scope: !139)
!218 = distinct !DISubprogram(name: "print_mat", scope: !1, file: !1, line: 152, type: !219, isLocal: false, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !282)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221, !11, !113}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !223, line: 48, baseType: !224)
!223 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/transpose/copyreduced_dealloc")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !225, line: 245, size: 1728, align: 64, elements: !226)
!225 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/transpose/copyreduced_dealloc")
!226 = !{!227, !228, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !249, !250, !251, !252, !256, !258, !260, !264, !267, !269, !270, !271, !272, !273, !277, !278}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !224, file: !225, line: 246, baseType: !54, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !224, file: !225, line: 251, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !224, file: !225, line: 252, baseType: !229, size: 64, align: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !224, file: !225, line: 253, baseType: !229, size: 64, align: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !224, file: !225, line: 254, baseType: !229, size: 64, align: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !224, file: !225, line: 255, baseType: !229, size: 64, align: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !224, file: !225, line: 256, baseType: !229, size: 64, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !224, file: !225, line: 257, baseType: !229, size: 64, align: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !224, file: !225, line: 258, baseType: !229, size: 64, align: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !224, file: !225, line: 260, baseType: !229, size: 64, align: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !224, file: !225, line: 261, baseType: !229, size: 64, align: 64, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !224, file: !225, line: 262, baseType: !229, size: 64, align: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !224, file: !225, line: 264, baseType: !242, size: 64, align: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !225, line: 160, size: 192, align: 64, elements: !244)
!244 = !{!245, !246, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !243, file: !225, line: 161, baseType: !242, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !243, file: !225, line: 162, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !243, file: !225, line: 166, baseType: !54, size: 32, align: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !224, file: !225, line: 266, baseType: !247, size: 64, align: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !224, file: !225, line: 268, baseType: !54, size: 32, align: 32, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !224, file: !225, line: 272, baseType: !54, size: 32, align: 32, offset: 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !224, file: !225, line: 274, baseType: !253, size: 64, align: 64, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !254, line: 131, baseType: !255)
!254 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/transpose/copyreduced_dealloc")
!255 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !224, file: !225, line: 278, baseType: !257, size: 16, align: 16, offset: 1024)
!257 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !224, file: !225, line: 279, baseType: !259, size: 8, align: 8, offset: 1040)
!259 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !224, file: !225, line: 280, baseType: !261, size: 8, align: 8, offset: 1048)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 8, align: 8, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 1)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !224, file: !225, line: 284, baseType: !265, size: 64, align: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !225, line: 154, baseType: null)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !224, file: !225, line: 293, baseType: !268, size: 64, align: 64, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !254, line: 132, baseType: !255)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !224, file: !225, line: 302, baseType: !4, size: 64, align: 64, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !224, file: !225, line: 303, baseType: !4, size: 64, align: 64, offset: 1280)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !224, file: !225, line: 304, baseType: !4, size: 64, align: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !224, file: !225, line: 305, baseType: !4, size: 64, align: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !224, file: !225, line: 306, baseType: !274, size: 64, align: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !275, line: 62, baseType: !276)
!275 = !DIFile(filename: "/home/mw169/polly/llvm_build/bin/../lib/clang/3.9.0/include/stddef.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/transpose/copyreduced_dealloc")
!276 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !224, file: !225, line: 308, baseType: !54, size: 32, align: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !224, file: !225, line: 310, baseType: !279, size: 160, align: 8, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 160, align: 8, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!283 = !DILocalVariable(name: "sys", arg: 1, scope: !218, file: !1, line: 152, type: !221)
!284 = !DILocalVariable(name: "a", arg: 2, scope: !218, file: !1, line: 152, type: !11)
!285 = !DILocalVariable(name: "a_dealloc", arg: 3, scope: !218, file: !1, line: 152, type: !113)
!286 = !DILocalVariable(name: "i", scope: !218, file: !1, line: 153, type: !18)
!287 = !DILocalVariable(name: "width", scope: !218, file: !1, line: 154, type: !18)
!288 = !DILocalVariable(name: "height", scope: !218, file: !1, line: 155, type: !18)
!289 = !DILocalVariable(name: "j", scope: !218, file: !1, line: 156, type: !18)
!290 = !DILocalVariable(name: "_6", scope: !218, file: !1, line: 157, type: !18)
!291 = !DILocalVariable(name: "_7", scope: !218, file: !1, line: 158, type: !18)
!292 = !DILocalVariable(name: "_8", scope: !218, file: !1, line: 159, type: !18)
!293 = !DILocalVariable(name: "_9", scope: !218, file: !1, line: 160, type: !18)
!294 = !DILocalVariable(name: "_10", scope: !218, file: !1, line: 161, type: !4)
!295 = !DILocalVariable(name: "_12", scope: !218, file: !1, line: 162, type: !17)
!296 = !DILocalVariable(name: "_12_size", scope: !218, file: !1, line: 162, type: !18)
!297 = !DILocalVariable(name: "_12_dealloc", scope: !218, file: !1, line: 163, type: !113)
!298 = !DILocalVariable(name: "_13", scope: !218, file: !1, line: 164, type: !18)
!299 = !DILocalVariable(name: "_14", scope: !218, file: !1, line: 165, type: !18)
!300 = !DILocalVariable(name: "_15", scope: !218, file: !1, line: 166, type: !18)
!301 = !DILocalVariable(name: "_16", scope: !218, file: !1, line: 167, type: !4)
!302 = !DILocalVariable(name: "_18", scope: !218, file: !1, line: 168, type: !17)
!303 = !DILocalVariable(name: "_18_size", scope: !218, file: !1, line: 168, type: !18)
!304 = !DILocalVariable(name: "_18_dealloc", scope: !218, file: !1, line: 169, type: !113)
!305 = !DILocalVariable(name: "_19", scope: !218, file: !1, line: 170, type: !18)
!306 = !DILocalVariable(name: "_20", scope: !218, file: !1, line: 171, type: !18)
!307 = !DILocalVariable(name: "_21", scope: !218, file: !1, line: 172, type: !18)
!308 = !DILocalVariable(name: "_22", scope: !218, file: !1, line: 173, type: !18)
!309 = !DILocalVariable(name: "_23", scope: !218, file: !1, line: 174, type: !4)
!310 = !DILocalVariable(name: "_25", scope: !218, file: !1, line: 175, type: !4)
!311 = !DILocalVariable(name: "_25_size", scope: !218, file: !1, line: 176, type: !18)
!312 = !DILocalVariable(name: "_25_dealloc", scope: !218, file: !1, line: 177, type: !113)
!313 = !DILocation(line: 152, column: 22, scope: !218)
!314 = !DILocation(line: 152, column: 35, scope: !218)
!315 = !DILocation(line: 152, column: 38, scope: !218)
!316 = !DILocation(line: 153, column: 12, scope: !218)
!317 = !DILocation(line: 154, column: 12, scope: !218)
!318 = !DILocation(line: 155, column: 12, scope: !218)
!319 = !DILocation(line: 156, column: 12, scope: !218)
!320 = !DILocation(line: 157, column: 12, scope: !218)
!321 = !DILocation(line: 158, column: 12, scope: !218)
!322 = !DILocation(line: 159, column: 12, scope: !218)
!323 = !DILocation(line: 160, column: 12, scope: !218)
!324 = !DILocation(line: 162, column: 2, scope: !218)
!325 = !DILocation(line: 163, column: 2, scope: !218)
!326 = !DILocation(line: 164, column: 12, scope: !218)
!327 = !DILocation(line: 165, column: 12, scope: !218)
!328 = !DILocation(line: 166, column: 12, scope: !218)
!329 = !DILocation(line: 168, column: 2, scope: !218)
!330 = !DILocation(line: 169, column: 2, scope: !218)
