; ModuleID = 'MatrixMult.c'
source_filename = "MatrixMult.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.Matrix = type { i64*, i64, i64, i64 }

@.str.1 = private unnamed_addr constant [7 x i8] c" data:\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c" width:\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"%lld\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c" height:\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [5 x i8] c"fail\00", align 1

; Function Attrs: nounwind uwtable
define noalias %struct.Matrix* @copy_Matrix(%struct.Matrix* nocapture readonly %_Matrix) #0 !dbg !8 {
entry:
  tail call void @llvm.dbg.value(metadata %struct.Matrix* %_Matrix, i64 0, metadata !23, metadata !25), !dbg !26
  %call = tail call noalias i8* @malloc(i64 32) #9, !dbg !27
  %0 = bitcast i8* %call to %struct.Matrix*, !dbg !29
  tail call void @llvm.dbg.value(metadata %struct.Matrix* %0, i64 0, metadata !24, metadata !25), !dbg !30

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (http://llvm.org/git/clang.git 83402ed45b681e9f38ce6626e5899c19159ceb29) (http://llvm.org/git/llvm.git 4fc8e6fd79f212952e8f538b6d5d9d78098b4505)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "MatrixMult.c", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (http://llvm.org/git/clang.git 83402ed45b681e9f38ce6626e5899c19159ceb29) (http://llvm.org/git/llvm.git 4fc8e6fd79f212952e8f538b6d5d9d78098b4505)"}
!8 = distinct !DISubprogram(name: "copy_Matrix", scope: !1, file: !1, line: 2, type: !9, isLocal: false, isDefinition: true, scopeLine: 2, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !22)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix", file: !13, line: 7, baseType: !14)
!13 = !DIFile(filename: "./MatrixMult.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 3, size: 256, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !14, file: !13, line: 4, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !14, file: !13, line: 4, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !14, file: !13, line: 5, baseType: !18, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !14, file: !13, line: 6, baseType: !18, size: 64, align: 64, offset: 192)
!22 = !{!23, !24}
!23 = !DILocalVariable(name: "_Matrix", arg: 1, scope: !8, file: !1, line: 2, type: !11)
!24 = !DILocalVariable(name: "new_Matrix", scope: !8, file: !1, line: 3, type: !11)
!25 = !DIExpression()
!26 = !DILocation(line: 2, column: 29, scope: !8)
!27 = !DILocation(line: 3, column: 23, scope: !28)
!28 = !DILexicalBlockFile(scope: !8, file: !1, discriminator: 1)
!29 = !DILocation(line: 3, column: 23, scope: !8)
!30 = !DILocation(line: 3, column: 10, scope: !8)
!31 = !DILocation(line: 4, column: 2, scope: !8)
!32 = !{!33, !37, i64 8}
!33 = !{!"", !34, i64 0, !37, i64 8, !37, i64 16, !37, i64 24}
!34 = !{!"any pointer", !35, i64 0}
!35 = !{!"omnipotent char", !36, i64 0}
!36 = !{!"Simple C/C++ TBAA"}
!37 = !{!"long long", !35, i64 0}
!38 = !{!33, !34, i64 0}
!39 = !DILocation(line: 5, column: 31, scope: !8)
!40 = !DILocation(line: 5, column: 14, scope: !8)
!41 = !{!37, !37, i64 0}
!42 = !DILocation(line: 5, column: 20, scope: !8)
!43 = !DILocation(line: 7, column: 2, scope: !8)
!44 = distinct !DISubprogram(name: "copy_array_Matrix", scope: !1, file: !1, line: 9, type: !45, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !48)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !47, !18}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!48 = !{!49, !50, !51, !52}
!49 = !DILocalVariable(name: "_Matrix", arg: 1, scope: !44, file: !1, line: 9, type: !47)
!50 = !DILocalVariable(name: "_Matrix_size", arg: 2, scope: !44, file: !1, line: 9, type: !18)
!51 = !DILocalVariable(name: "new_Matrix", scope: !44, file: !1, line: 10, type: !47)
!52 = !DILocalVariable(name: "i", scope: !53, file: !1, line: 11, type: !54)
!53 = distinct !DILexicalBlock(scope: !44, file: !1, line: 11, column: 2)
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = !DILocation(line: 9, column: 37, scope: !44)
!56 = !DILocation(line: 9, column: 56, scope: !44)
!57 = !DILocation(line: 10, column: 43, scope: !44)
!58 = !DILocation(line: 10, column: 24, scope: !59)
!59 = !DILexicalBlockFile(scope: !44, file: !1, discriminator: 1)
!60 = !DILocation(line: 10, column: 24, scope: !44)
!61 = !DILocation(line: 10, column: 11, scope: !44)
!62 = !DILocation(line: 11, column: 10, scope: !53)
!63 = !DILocation(line: 11, column: 15, scope: !64)
!64 = !DILexicalBlockFile(scope: !65, file: !1, discriminator: 1)
!65 = distinct !DILexicalBlock(scope: !53, file: !1, line: 11, column: 2)
!66 = !DILocation(line: 11, column: 2, scope: !64)
!67 = !DILocation(line: 12, column: 31, scope: !68)
!68 = distinct !DILexicalBlock(scope: !65, file: !1, line: 11, column: 33)
!69 = !DILocation(line: 14, column: 2, scope: !44)
!70 = !{!34, !34, i64 0}
!71 = !DILocation(line: 2, column: 29, scope: !8, inlinedAt: !72)
!72 = distinct !DILocation(line: 12, column: 19, scope: !68)
!73 = !DILocation(line: 3, column: 23, scope: !28, inlinedAt: !72)
!74 = !DILocation(line: 4, column: 2, scope: !8, inlinedAt: !72)
!75 = !DILocation(line: 5, column: 31, scope: !8, inlinedAt: !72)
!76 = !DILocation(line: 5, column: 14, scope: !8, inlinedAt: !72)
!77 = !DILocation(line: 5, column: 20, scope: !8, inlinedAt: !72)
!78 = !DILocation(line: 12, column: 3, scope: !68)
!79 = !DILocation(line: 12, column: 17, scope: !68)
!80 = distinct !DISubprogram(name: "free_Matrix", scope: !1, file: !1, line: 16, type: !81, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !83)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !11}
!83 = !{!84}
!84 = !DILocalVariable(name: "matrix", arg: 1, scope: !80, file: !1, line: 16, type: !11)
!85 = !DILocation(line: 16, column: 26, scope: !80)
!86 = !DILocation(line: 17, column: 15, scope: !80)
!87 = !DILocation(line: 17, column: 2, scope: !80)
!88 = !DILocation(line: 18, column: 7, scope: !80)
!89 = !DILocation(line: 18, column: 2, scope: !80)
!90 = !DILocation(line: 19, column: 1, scope: !80)
!91 = distinct !DISubprogram(name: "printf_Matrix", scope: !1, file: !1, line: 20, type: !81, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !92)
!92 = !{!93}
!93 = !DILocalVariable(name: "matrix", arg: 1, scope: !91, file: !1, line: 20, type: !11)
!94 = !DILocation(line: 20, column: 28, scope: !91)
!95 = !DILocation(line: 21, column: 2, scope: !91)
!96 = !DILocation(line: 22, column: 2, scope: !91)
!97 = !DILocation(line: 23, column: 2, scope: !91)
!98 = !DILocation(line: 24, column: 2, scope: !91)
!99 = !DILocation(line: 25, column: 25, scope: !91)
!100 = !{!33, !37, i64 16}
!101 = !DILocation(line: 25, column: 2, scope: !91)
!102 = !DILocation(line: 26, column: 2, scope: !91)
!103 = !DILocation(line: 27, column: 25, scope: !91)
!104 = !{!33, !37, i64 24}
!105 = !DILocation(line: 27, column: 2, scope: !91)
!106 = !DILocation(line: 28, column: 2, scope: !91)
!107 = !DILocation(line: 29, column: 1, scope: !91)
!108 = distinct !DISubprogram(name: "matrix", scope: !1, file: !1, line: 30, type: !109, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !112)
!109 = !DISubroutineType(types: !110)
!110 = !{!11, !18, !18, !17, !18, !111}
!111 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121}
!113 = !DILocalVariable(name: "width", arg: 1, scope: !108, file: !1, line: 30, type: !18)
!114 = !DILocalVariable(name: "height", arg: 2, scope: !108, file: !1, line: 30, type: !18)
!115 = !DILocalVariable(name: "data", arg: 3, scope: !108, file: !1, line: 30, type: !17)
!116 = !DILocalVariable(name: "data_size", arg: 4, scope: !108, file: !1, line: 30, type: !18)
!117 = !DILocalVariable(name: "data_has_ownership", arg: 5, scope: !108, file: !1, line: 30, type: !111)
!118 = !DILocalVariable(name: "r", scope: !108, file: !1, line: 31, type: !11)
!119 = !DILocalVariable(name: "r_has_ownership", scope: !108, file: !1, line: 32, type: !111)
!120 = !DILocalVariable(name: "_4", scope: !108, file: !1, line: 33, type: !11)
!121 = !DILocalVariable(name: "_4_has_ownership", scope: !108, file: !1, line: 34, type: !111)
!122 = !DILocation(line: 30, column: 26, scope: !108)
!123 = !DILocation(line: 30, column: 43, scope: !108)
!124 = !DILocation(line: 30, column: 51, scope: !108)
!125 = !DIExpression(DW_OP_bit_piece, 0, 1)
!126 = !DILocation(line: 30, column: 78, scope: !108)
!127 = !DILocation(line: 32, column: 2, scope: !108)
!128 = !DILocation(line: 34, column: 2, scope: !108)
!129 = !DILocation(line: 37, column: 7, scope: !108)
!130 = !DILocation(line: 33, column: 10, scope: !108)
!131 = !DILocation(line: 38, column: 2, scope: !108)
!132 = !DILocation(line: 39, column: 6, scope: !108)
!133 = !DILocation(line: 39, column: 13, scope: !108)
!134 = !DILocation(line: 40, column: 6, scope: !108)
!135 = !DILocation(line: 40, column: 12, scope: !108)
!136 = !DILocation(line: 43, column: 2, scope: !108)
!137 = !DILocation(line: 43, column: 2, scope: !138)
!138 = !DILexicalBlockFile(scope: !139, file: !1, discriminator: 1)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 43, column: 2)
!140 = distinct !DILexicalBlock(scope: !108, file: !1, line: 43, column: 2)
!141 = !DILocation(line: 45, column: 2, scope: !108)
!142 = distinct !DISubprogram(name: "init", scope: !1, file: !1, line: 49, type: !143, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{!11, !18, !18}
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!146 = !DILocalVariable(name: "width", arg: 1, scope: !142, file: !1, line: 49, type: !18)
!147 = !DILocalVariable(name: "height", arg: 2, scope: !142, file: !1, line: 49, type: !18)
!148 = !DILocalVariable(name: "r", scope: !142, file: !1, line: 50, type: !11)
!149 = !DILocalVariable(name: "r_has_ownership", scope: !142, file: !1, line: 51, type: !111)
!150 = !DILocalVariable(name: "data", scope: !142, file: !1, line: 52, type: !17)
!151 = !DILocalVariable(name: "data_size", scope: !142, file: !1, line: 52, type: !18)
!152 = !DILocalVariable(name: "data_has_ownership", scope: !142, file: !1, line: 53, type: !111)
!153 = !DILocalVariable(name: "i", scope: !142, file: !1, line: 54, type: !18)
!154 = !DILocalVariable(name: "j", scope: !142, file: !1, line: 55, type: !18)
!155 = !DILocalVariable(name: "_6", scope: !142, file: !1, line: 56, type: !18)
!156 = !DILocalVariable(name: "_7", scope: !142, file: !1, line: 57, type: !18)
!157 = !DILocalVariable(name: "_8", scope: !142, file: !1, line: 58, type: !17)
!158 = !DILocalVariable(name: "_8_size", scope: !142, file: !1, line: 58, type: !18)
!159 = !DILocalVariable(name: "_8_has_ownership", scope: !142, file: !1, line: 59, type: !111)
!160 = !DILocalVariable(name: "_9", scope: !142, file: !1, line: 60, type: !18)
!161 = !DILocalVariable(name: "_10", scope: !142, file: !1, line: 61, type: !18)
!162 = !DILocalVariable(name: "_11", scope: !142, file: !1, line: 62, type: !18)
!163 = !DILocalVariable(name: "_12", scope: !142, file: !1, line: 63, type: !18)
!164 = !DILocalVariable(name: "_13", scope: !142, file: !1, line: 64, type: !18)
!165 = !DILocalVariable(name: "_14", scope: !142, file: !1, line: 65, type: !18)
!166 = !DILocalVariable(name: "_15", scope: !142, file: !1, line: 66, type: !18)
!167 = !DILocalVariable(name: "_16", scope: !142, file: !1, line: 67, type: !18)
!168 = !DILocalVariable(name: "_17", scope: !142, file: !1, line: 68, type: !18)
!169 = !DILocalVariable(name: "_18", scope: !142, file: !1, line: 69, type: !18)
!170 = !DILocalVariable(name: "_19", scope: !142, file: !1, line: 70, type: !18)
!171 = !DILocalVariable(name: "_20", scope: !142, file: !1, line: 71, type: !18)
!172 = !DILocalVariable(name: "_21", scope: !142, file: !1, line: 72, type: !11)
!173 = !DILocalVariable(name: "_21_has_ownership", scope: !142, file: !1, line: 73, type: !111)
!174 = !DILocation(line: 49, column: 24, scope: !142)
!175 = !DILocation(line: 49, column: 41, scope: !142)
!176 = !DILocation(line: 51, column: 2, scope: !142)
!177 = !DILocation(line: 52, column: 2, scope: !142)
!178 = !DILocation(line: 53, column: 2, scope: !142)
!179 = !DILocation(line: 54, column: 12, scope: !142)
!180 = !DILocation(line: 55, column: 12, scope: !142)
!181 = !DILocation(line: 56, column: 12, scope: !142)
!182 = !DILocation(line: 57, column: 12, scope: !142)
!183 = !DILocation(line: 58, column: 2, scope: !142)
!184 = !DILocation(line: 59, column: 2, scope: !142)
!185 = !DILocation(line: 60, column: 12, scope: !142)
!186 = !DILocation(line: 61, column: 12, scope: !142)
!187 = !DILocation(line: 62, column: 12, scope: !142)
!188 = !DILocation(line: 63, column: 12, scope: !142)
!189 = !DILocation(line: 64, column: 12, scope: !142)
!190 = !DILocation(line: 65, column: 12, scope: !142)
!191 = !DILocation(line: 66, column: 12, scope: !142)
!192 = !DILocation(line: 67, column: 12, scope: !142)
!193 = !DILocation(line: 68, column: 12, scope: !142)
!194 = !DILocation(line: 69, column: 12, scope: !142)
!195 = !DILocation(line: 70, column: 12, scope: !142)
!196 = !DILocation(line: 71, column: 12, scope: !142)
!197 = !DILocation(line: 73, column: 2, scope: !142)
!198 = !DILocation(line: 77, column: 10, scope: !142)
!199 = !DILocation(line: 80, column: 2, scope: !142)
!200 = !DILocation(line: 94, column: 7, scope: !201)
!201 = distinct !DILexicalBlock(scope: !202, file: !1, line: 94, column: 6)
!202 = distinct !DILexicalBlock(scope: !142, file: !1, line: 92, column: 13)
!203 = !DILocation(line: 94, column: 6, scope: !202)
!204 = !DILocation(line: 30, column: 26, scope: !108, inlinedAt: !205)
!205 = distinct !DILocation(line: 141, column: 8, scope: !142)
!206 = !DILocation(line: 30, column: 43, scope: !108, inlinedAt: !205)
!207 = !DILocation(line: 30, column: 51, scope: !108, inlinedAt: !205)
!208 = !DILocation(line: 30, column: 78, scope: !108, inlinedAt: !205)
!209 = !DILocation(line: 32, column: 2, scope: !108, inlinedAt: !205)
!210 = !DILocation(line: 34, column: 2, scope: !108, inlinedAt: !205)
!211 = !DILocation(line: 37, column: 7, scope: !108, inlinedAt: !205)
!212 = !DILocation(line: 33, column: 10, scope: !108, inlinedAt: !205)
!213 = !DILocation(line: 38, column: 2, scope: !108, inlinedAt: !205)
!214 = !DILocation(line: 39, column: 6, scope: !108, inlinedAt: !205)
!215 = !DILocation(line: 39, column: 13, scope: !108, inlinedAt: !205)
!216 = !DILocation(line: 40, column: 6, scope: !108, inlinedAt: !205)
!217 = !DILocation(line: 40, column: 12, scope: !108, inlinedAt: !205)
!218 = !DILocation(line: 72, column: 10, scope: !142)
!219 = !DILocation(line: 145, column: 2, scope: !220)
!220 = !DILexicalBlockFile(scope: !221, file: !1, discriminator: 1)
!221 = distinct !DILexicalBlock(scope: !222, file: !1, line: 145, column: 2)
!222 = distinct !DILexicalBlock(scope: !142, file: !1, line: 145, column: 2)
!223 = !DILocation(line: 147, column: 2, scope: !142)
!224 = !DILocation(line: 141, column: 8, scope: !142)
!225 = distinct !DISubprogram(name: "print_mat", scope: !1, file: !1, line: 151, type: !226, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !289)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228, !11, !111}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !230, line: 48, baseType: !231)
!230 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !232, line: 245, size: 1728, align: 64, elements: !233)
!232 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!233 = !{!234, !235, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !256, !257, !258, !259, !263, !265, !267, !271, !274, !276, !277, !278, !279, !280, !284, !285}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !231, file: !232, line: 246, baseType: !54, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !231, file: !232, line: 251, baseType: !236, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !231, file: !232, line: 252, baseType: !236, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !231, file: !232, line: 253, baseType: !236, size: 64, align: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !231, file: !232, line: 254, baseType: !236, size: 64, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !231, file: !232, line: 255, baseType: !236, size: 64, align: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !231, file: !232, line: 256, baseType: !236, size: 64, align: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !231, file: !232, line: 257, baseType: !236, size: 64, align: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !231, file: !232, line: 258, baseType: !236, size: 64, align: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !231, file: !232, line: 260, baseType: !236, size: 64, align: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !231, file: !232, line: 261, baseType: !236, size: 64, align: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !231, file: !232, line: 262, baseType: !236, size: 64, align: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !231, file: !232, line: 264, baseType: !249, size: 64, align: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !232, line: 160, size: 192, align: 64, elements: !251)
!251 = !{!252, !253, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !250, file: !232, line: 161, baseType: !249, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !250, file: !232, line: 162, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !250, file: !232, line: 166, baseType: !54, size: 32, align: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !231, file: !232, line: 266, baseType: !254, size: 64, align: 64, offset: 832)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !231, file: !232, line: 268, baseType: !54, size: 32, align: 32, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !231, file: !232, line: 272, baseType: !54, size: 32, align: 32, offset: 928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !231, file: !232, line: 274, baseType: !260, size: 64, align: 64, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !261, line: 131, baseType: !262)
!261 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!262 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !231, file: !232, line: 278, baseType: !264, size: 16, align: 16, offset: 1024)
!264 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !231, file: !232, line: 279, baseType: !266, size: 8, align: 8, offset: 1040)
!266 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !231, file: !232, line: 280, baseType: !268, size: 8, align: 8, offset: 1048)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 8, align: 8, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 1)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !231, file: !232, line: 284, baseType: !272, size: 64, align: 64, offset: 1088)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !232, line: 154, baseType: null)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !231, file: !232, line: 293, baseType: !275, size: 64, align: 64, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !261, line: 132, baseType: !262)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !231, file: !232, line: 302, baseType: !4, size: 64, align: 64, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !231, file: !232, line: 303, baseType: !4, size: 64, align: 64, offset: 1280)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !231, file: !232, line: 304, baseType: !4, size: 64, align: 64, offset: 1344)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !231, file: !232, line: 305, baseType: !4, size: 64, align: 64, offset: 1408)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !231, file: !232, line: 306, baseType: !281, size: 64, align: 64, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !282, line: 62, baseType: !283)
!282 = !DIFile(filename: "/home/sam/polly/llvm_build/bin/../lib/clang/3.9.0/include/stddef.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!283 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !231, file: !232, line: 308, baseType: !54, size: 32, align: 32, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !231, file: !232, line: 310, baseType: !286, size: 160, align: 8, offset: 1568)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 160, align: 8, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 20)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!290 = !DILocalVariable(name: "sys", arg: 1, scope: !225, file: !1, line: 151, type: !228)
!291 = !DILocalVariable(name: "a", arg: 2, scope: !225, file: !1, line: 151, type: !11)
!292 = !DILocalVariable(name: "a_has_ownership", arg: 3, scope: !225, file: !1, line: 151, type: !111)
!293 = !DILocalVariable(name: "i", scope: !225, file: !1, line: 152, type: !18)
!294 = !DILocalVariable(name: "width", scope: !225, file: !1, line: 153, type: !18)
!295 = !DILocalVariable(name: "height", scope: !225, file: !1, line: 154, type: !18)
!296 = !DILocalVariable(name: "j", scope: !225, file: !1, line: 155, type: !18)
!297 = !DILocalVariable(name: "_6", scope: !225, file: !1, line: 156, type: !18)
!298 = !DILocalVariable(name: "_7", scope: !225, file: !1, line: 157, type: !18)
!299 = !DILocalVariable(name: "_8", scope: !225, file: !1, line: 158, type: !18)
!300 = !DILocalVariable(name: "_9", scope: !225, file: !1, line: 159, type: !18)
!301 = !DILocalVariable(name: "_10", scope: !225, file: !1, line: 160, type: !4)
!302 = !DILocalVariable(name: "_12", scope: !225, file: !1, line: 161, type: !17)
!303 = !DILocalVariable(name: "_12_size", scope: !225, file: !1, line: 161, type: !18)
!304 = !DILocalVariable(name: "_12_has_ownership", scope: !225, file: !1, line: 162, type: !111)
!305 = !DILocalVariable(name: "_13", scope: !225, file: !1, line: 163, type: !18)
!306 = !DILocalVariable(name: "_14", scope: !225, file: !1, line: 164, type: !18)
!307 = !DILocalVariable(name: "_15", scope: !225, file: !1, line: 165, type: !18)
!308 = !DILocalVariable(name: "_16", scope: !225, file: !1, line: 166, type: !4)
!309 = !DILocalVariable(name: "_18", scope: !225, file: !1, line: 167, type: !17)
!310 = !DILocalVariable(name: "_18_size", scope: !225, file: !1, line: 167, type: !18)
!311 = !DILocalVariable(name: "_18_has_ownership", scope: !225, file: !1, line: 168, type: !111)
!312 = !DILocalVariable(name: "_19", scope: !225, file: !1, line: 169, type: !18)
!313 = !DILocalVariable(name: "_20", scope: !225, file: !1, line: 170, type: !18)
!314 = !DILocalVariable(name: "_21", scope: !225, file: !1, line: 171, type: !18)
!315 = !DILocalVariable(name: "_22", scope: !225, file: !1, line: 172, type: !18)
!316 = !DILocalVariable(name: "_23", scope: !225, file: !1, line: 173, type: !4)
!317 = !DILocalVariable(name: "_25", scope: !225, file: !1, line: 174, type: !4)
!318 = !DILocalVariable(name: "_25_size", scope: !225, file: !1, line: 175, type: !18)
!319 = !DILocalVariable(name: "_25_has_ownership", scope: !225, file: !1, line: 176, type: !111)
!320 = !DILocation(line: 151, column: 22, scope: !225)
!321 = !DILocation(line: 151, column: 35, scope: !225)
!322 = !DILocation(line: 151, column: 38, scope: !225)
!323 = !DILocation(line: 152, column: 12, scope: !225)
!324 = !DILocation(line: 153, column: 12, scope: !225)
!325 = !DILocation(line: 154, column: 12, scope: !225)
!326 = !DILocation(line: 155, column: 12, scope: !225)
!327 = !DILocation(line: 156, column: 12, scope: !225)
!328 = !DILocation(line: 157, column: 12, scope: !225)
!329 = !DILocation(line: 158, column: 12, scope: !225)
!330 = !DILocation(line: 159, column: 12, scope: !225)
!331 = !DILocation(line: 161, column: 2, scope: !225)
!332 = !DILocation(line: 162, column: 2, scope: !225)
!333 = !DILocation(line: 163, column: 12, scope: !225)
!334 = !DILocation(line: 164, column: 12, scope: !225)
!335 = !DILocation(line: 165, column: 12, scope: !225)
!336 = !DILocation(line: 167, column: 2, scope: !225)
!337 = !DILocation(line: 168, column: 2, scope: !225)
