; ModuleID = 'MatrixMult.c'
source_filename = "MatrixMult.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.Matrix = type { i64*, i64, i64, i64 }

@.str.1 = private unnamed_addr constant [7 x i8] c" data:\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c" width:\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"%lld\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c" height:\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [5 x i8] c"fail\00", align 1

; Function Attrs: nounwind uwtable
define noalias %struct.Matrix* @copy_Matrix(%struct.Matrix* nocapture readonly %_Matrix) #0 !dbg !8 {
entry:
  tail call void @llvm.dbg.value(metadata %struct.Matrix* %_Matrix, i64 0, metadata !23, metadata !25), !dbg !26
  %call = tail call noalias i8* @malloc(i64 32) #9, !dbg !27
  %0 = bitcast i8* %call to %struct.Matrix*, !dbg !29
  tail call void @llvm.dbg.value(metadata %struct.Matrix* %0, i64 0, metadata !24, metadata !25), !dbg !30

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (http://llvm.org/git/clang.git 2af14cc4a90f43170f8ea9c1dfa0f71f46a0621c) (http://llvm.org/git/llvm.git 1e7e2b2b556977af8ccc12b7afba61302f3a2da9)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "MatrixMult.c", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{i32 2, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{!"clang version 3.9.0 (http://llvm.org/git/clang.git 2af14cc4a90f43170f8ea9c1dfa0f71f46a0621c) (http://llvm.org/git/llvm.git 1e7e2b2b556977af8ccc12b7afba61302f3a2da9)"}
!8 = distinct !DISubprogram(name: "copy_Matrix", scope: !1, file: !1, line: 2, type: !9, isLocal: false, isDefinition: true, scopeLine: 2, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !22)
!9 = !DISubroutineType(types: !10)
!10 = !{!11, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix", file: !13, line: 7, baseType: !14)
!13 = !DIFile(filename: "./MatrixMult.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 3, size: 256, align: 64, elements: !15)
!15 = !{!16, !19, !20, !21}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !14, file: !13, line: 4, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !14, file: !13, line: 4, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !14, file: !13, line: 5, baseType: !18, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !14, file: !13, line: 6, baseType: !18, size: 64, align: 64, offset: 192)
!22 = !{!23, !24}
!23 = !DILocalVariable(name: "_Matrix", arg: 1, scope: !8, file: !1, line: 2, type: !11)
!24 = !DILocalVariable(name: "new_Matrix", scope: !8, file: !1, line: 3, type: !11)
!25 = !DIExpression()
!26 = !DILocation(line: 2, column: 29, scope: !8)
!27 = !DILocation(line: 3, column: 23, scope: !28)
!28 = !DILexicalBlockFile(scope: !8, file: !1, discriminator: 1)
!29 = !DILocation(line: 3, column: 23, scope: !8)
!30 = !DILocation(line: 3, column: 10, scope: !8)
!31 = !DILocation(line: 4, column: 2, scope: !8)
!32 = !{!33, !37, i64 8}
!33 = !{!"", !34, i64 0, !37, i64 8, !37, i64 16, !37, i64 24}
!34 = !{!"any pointer", !35, i64 0}
!35 = !{!"omnipotent char", !36, i64 0}
!36 = !{!"Simple C/C++ TBAA"}
!37 = !{!"long long", !35, i64 0}
!38 = !{!33, !34, i64 0}
!39 = !DILocation(line: 5, column: 31, scope: !8)
!40 = !DILocation(line: 5, column: 14, scope: !8)
!41 = !{!37, !37, i64 0}
!42 = !DILocation(line: 5, column: 20, scope: !8)
!43 = !DILocation(line: 7, column: 2, scope: !8)
!44 = distinct !DISubprogram(name: "copy_array_Matrix", scope: !1, file: !1, line: 9, type: !45, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !48)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !47, !18}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!48 = !{!49, !50, !51, !52}
!49 = !DILocalVariable(name: "_Matrix", arg: 1, scope: !44, file: !1, line: 9, type: !47)
!50 = !DILocalVariable(name: "_Matrix_size", arg: 2, scope: !44, file: !1, line: 9, type: !18)
!51 = !DILocalVariable(name: "new_Matrix", scope: !44, file: !1, line: 10, type: !47)
!52 = !DILocalVariable(name: "i", scope: !53, file: !1, line: 11, type: !54)
!53 = distinct !DILexicalBlock(scope: !44, file: !1, line: 11, column: 2)
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = !DILocation(line: 9, column: 37, scope: !44)
!56 = !DILocation(line: 9, column: 56, scope: !44)
!57 = !DILocation(line: 10, column: 43, scope: !44)
!58 = !DILocation(line: 10, column: 24, scope: !59)
!59 = !DILexicalBlockFile(scope: !44, file: !1, discriminator: 1)
!60 = !DILocation(line: 10, column: 24, scope: !44)
!61 = !DILocation(line: 10, column: 11, scope: !44)
!62 = !DILocation(line: 11, column: 10, scope: !53)
!63 = !DILocation(line: 11, column: 15, scope: !64)
!64 = !DILexicalBlockFile(scope: !65, file: !1, discriminator: 1)
!65 = distinct !DILexicalBlock(scope: !53, file: !1, line: 11, column: 2)
!66 = !DILocation(line: 11, column: 2, scope: !64)
!67 = !DILocation(line: 12, column: 31, scope: !68)
!68 = distinct !DILexicalBlock(scope: !65, file: !1, line: 11, column: 33)
!69 = !DILocation(line: 14, column: 2, scope: !44)
!70 = !{!34, !34, i64 0}
!71 = !DILocation(line: 2, column: 29, scope: !8, inlinedAt: !72)
!72 = distinct !DILocation(line: 12, column: 19, scope: !68)
!73 = !DILocation(line: 3, column: 23, scope: !28, inlinedAt: !72)
!74 = !DILocation(line: 4, column: 2, scope: !8, inlinedAt: !72)
!75 = !DILocation(line: 5, column: 31, scope: !8, inlinedAt: !72)
!76 = !DILocation(line: 5, column: 14, scope: !8, inlinedAt: !72)
!77 = !DILocation(line: 5, column: 20, scope: !8, inlinedAt: !72)
!78 = !DILocation(line: 12, column: 3, scope: !68)
!79 = !DILocation(line: 12, column: 17, scope: !68)
!80 = distinct !DISubprogram(name: "free_Matrix", scope: !1, file: !1, line: 16, type: !81, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !83)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !11}
!83 = !{!84}
!84 = !DILocalVariable(name: "matrix", arg: 1, scope: !80, file: !1, line: 16, type: !11)
!85 = !DILocation(line: 16, column: 26, scope: !80)
!86 = !DILocation(line: 17, column: 15, scope: !80)
!87 = !DILocation(line: 17, column: 2, scope: !80)
!88 = !DILocation(line: 18, column: 7, scope: !80)
!89 = !DILocation(line: 18, column: 2, scope: !80)
!90 = !DILocation(line: 19, column: 1, scope: !80)
!91 = distinct !DISubprogram(name: "printf_Matrix", scope: !1, file: !1, line: 20, type: !81, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !92)
!92 = !{!93}
!93 = !DILocalVariable(name: "matrix", arg: 1, scope: !91, file: !1, line: 20, type: !11)
!94 = !DILocation(line: 20, column: 28, scope: !91)
!95 = !DILocation(line: 21, column: 2, scope: !91)
!96 = !DILocation(line: 22, column: 2, scope: !91)
!97 = !DILocation(line: 23, column: 2, scope: !91)
!98 = !DILocation(line: 24, column: 2, scope: !91)
!99 = !DILocation(line: 25, column: 25, scope: !91)
!100 = !{!33, !37, i64 16}
!101 = !DILocation(line: 25, column: 2, scope: !91)
!102 = !DILocation(line: 26, column: 2, scope: !91)
!103 = !DILocation(line: 27, column: 25, scope: !91)
!104 = !{!33, !37, i64 24}
!105 = !DILocation(line: 27, column: 2, scope: !91)
!106 = !DILocation(line: 28, column: 2, scope: !91)
!107 = !DILocation(line: 29, column: 1, scope: !91)
!108 = distinct !DISubprogram(name: "matrix", scope: !1, file: !1, line: 30, type: !109, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !111)
!109 = !DISubroutineType(types: !110)
!110 = !{!11, !18, !18, !17, !18}
!111 = !{!112, !113, !114, !115, !116, !117}
!112 = !DILocalVariable(name: "width", arg: 1, scope: !108, file: !1, line: 30, type: !18)
!113 = !DILocalVariable(name: "height", arg: 2, scope: !108, file: !1, line: 30, type: !18)
!114 = !DILocalVariable(name: "data", arg: 3, scope: !108, file: !1, line: 30, type: !17)
!115 = !DILocalVariable(name: "data_size", arg: 4, scope: !108, file: !1, line: 30, type: !18)
!116 = !DILocalVariable(name: "r", scope: !108, file: !1, line: 31, type: !11)
!117 = !DILocalVariable(name: "_4", scope: !108, file: !1, line: 32, type: !11)
!118 = !DILocation(line: 30, column: 26, scope: !108)
!119 = !DILocation(line: 30, column: 43, scope: !108)
!120 = !DILocation(line: 30, column: 51, scope: !108)
!121 = !DILocation(line: 34, column: 7, scope: !108)
!122 = !DILocation(line: 32, column: 10, scope: !108)
!123 = !DILocation(line: 35, column: 2, scope: !108)
!124 = !DILocation(line: 36, column: 6, scope: !108)
!125 = !DILocation(line: 36, column: 13, scope: !108)
!126 = !DILocation(line: 37, column: 6, scope: !108)
!127 = !DILocation(line: 37, column: 12, scope: !108)
!128 = !DILocation(line: 39, column: 2, scope: !108)
!129 = distinct !DISubprogram(name: "init", scope: !1, file: !1, line: 43, type: !130, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{!11, !18, !18}
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!133 = !DILocalVariable(name: "width", arg: 1, scope: !129, file: !1, line: 43, type: !18)
!134 = !DILocalVariable(name: "height", arg: 2, scope: !129, file: !1, line: 43, type: !18)
!135 = !DILocalVariable(name: "r", scope: !129, file: !1, line: 44, type: !11)
!136 = !DILocalVariable(name: "data", scope: !129, file: !1, line: 45, type: !17)
!137 = !DILocalVariable(name: "data_size", scope: !129, file: !1, line: 45, type: !18)
!138 = !DILocalVariable(name: "i", scope: !129, file: !1, line: 46, type: !18)
!139 = !DILocalVariable(name: "j", scope: !129, file: !1, line: 47, type: !18)
!140 = !DILocalVariable(name: "_6", scope: !129, file: !1, line: 48, type: !18)
!141 = !DILocalVariable(name: "_7", scope: !129, file: !1, line: 49, type: !18)
!142 = !DILocalVariable(name: "_8", scope: !129, file: !1, line: 50, type: !17)
!143 = !DILocalVariable(name: "_8_size", scope: !129, file: !1, line: 50, type: !18)
!144 = !DILocalVariable(name: "_9", scope: !129, file: !1, line: 51, type: !18)
!145 = !DILocalVariable(name: "_10", scope: !129, file: !1, line: 52, type: !18)
!146 = !DILocalVariable(name: "_11", scope: !129, file: !1, line: 53, type: !18)
!147 = !DILocalVariable(name: "_12", scope: !129, file: !1, line: 54, type: !18)
!148 = !DILocalVariable(name: "_13", scope: !129, file: !1, line: 55, type: !18)
!149 = !DILocalVariable(name: "_14", scope: !129, file: !1, line: 56, type: !18)
!150 = !DILocalVariable(name: "_15", scope: !129, file: !1, line: 57, type: !18)
!151 = !DILocalVariable(name: "_16", scope: !129, file: !1, line: 58, type: !18)
!152 = !DILocalVariable(name: "_17", scope: !129, file: !1, line: 59, type: !18)
!153 = !DILocalVariable(name: "_18", scope: !129, file: !1, line: 60, type: !18)
!154 = !DILocalVariable(name: "_19", scope: !129, file: !1, line: 61, type: !18)
!155 = !DILocalVariable(name: "_20", scope: !129, file: !1, line: 62, type: !18)
!156 = !DILocalVariable(name: "_21", scope: !129, file: !1, line: 63, type: !11)
!157 = !DILocation(line: 43, column: 24, scope: !129)
!158 = !DILocation(line: 43, column: 41, scope: !129)
!159 = !DILocation(line: 45, column: 2, scope: !129)
!160 = !DILocation(line: 46, column: 12, scope: !129)
!161 = !DILocation(line: 47, column: 12, scope: !129)
!162 = !DILocation(line: 48, column: 12, scope: !129)
!163 = !DILocation(line: 49, column: 12, scope: !129)
!164 = !DILocation(line: 50, column: 2, scope: !129)
!165 = !DILocation(line: 51, column: 12, scope: !129)
!166 = !DILocation(line: 52, column: 12, scope: !129)
!167 = !DILocation(line: 53, column: 12, scope: !129)
!168 = !DILocation(line: 54, column: 12, scope: !129)
!169 = !DILocation(line: 55, column: 12, scope: !129)
!170 = !DILocation(line: 56, column: 12, scope: !129)
!171 = !DILocation(line: 57, column: 12, scope: !129)
!172 = !DILocation(line: 58, column: 12, scope: !129)
!173 = !DILocation(line: 59, column: 12, scope: !129)
!174 = !DILocation(line: 60, column: 12, scope: !129)
!175 = !DILocation(line: 61, column: 12, scope: !129)
!176 = !DILocation(line: 62, column: 12, scope: !129)
!177 = !DILocation(line: 67, column: 10, scope: !129)
!178 = !DILocation(line: 69, column: 2, scope: !129)
!179 = !DILocation(line: 79, column: 7, scope: !180)
!180 = distinct !DILexicalBlock(scope: !181, file: !1, line: 79, column: 6)
!181 = distinct !DILexicalBlock(scope: !129, file: !1, line: 77, column: 13)
!182 = !DILocation(line: 79, column: 6, scope: !181)
!183 = !DILocation(line: 30, column: 26, scope: !108, inlinedAt: !184)
!184 = distinct !DILocation(line: 125, column: 8, scope: !129)
!185 = !DILocation(line: 30, column: 43, scope: !108, inlinedAt: !184)
!186 = !DILocation(line: 30, column: 51, scope: !108, inlinedAt: !184)
!187 = !DILocation(line: 34, column: 7, scope: !108, inlinedAt: !184)
!188 = !DILocation(line: 32, column: 10, scope: !108, inlinedAt: !184)
!189 = !DILocation(line: 35, column: 2, scope: !108, inlinedAt: !184)
!190 = !DILocation(line: 36, column: 6, scope: !108, inlinedAt: !184)
!191 = !DILocation(line: 36, column: 13, scope: !108, inlinedAt: !184)
!192 = !DILocation(line: 37, column: 6, scope: !108, inlinedAt: !184)
!193 = !DILocation(line: 37, column: 12, scope: !108, inlinedAt: !184)
!194 = !DILocation(line: 63, column: 10, scope: !129)
!195 = !DILocation(line: 127, column: 2, scope: !129)
!196 = !DILocation(line: 125, column: 8, scope: !129)
!197 = distinct !DISubprogram(name: "print_mat", scope: !1, file: !1, line: 131, type: !198, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !261)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !200, !11}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !202, line: 48, baseType: !203)
!202 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !204, line: 245, size: 1728, align: 64, elements: !205)
!204 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!205 = !{!206, !207, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !228, !229, !230, !231, !235, !237, !239, !243, !246, !248, !249, !250, !251, !252, !256, !257}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !203, file: !204, line: 246, baseType: !54, size: 32, align: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !203, file: !204, line: 251, baseType: !208, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !203, file: !204, line: 252, baseType: !208, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !203, file: !204, line: 253, baseType: !208, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !203, file: !204, line: 254, baseType: !208, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !203, file: !204, line: 255, baseType: !208, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !203, file: !204, line: 256, baseType: !208, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !203, file: !204, line: 257, baseType: !208, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !203, file: !204, line: 258, baseType: !208, size: 64, align: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !203, file: !204, line: 260, baseType: !208, size: 64, align: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !203, file: !204, line: 261, baseType: !208, size: 64, align: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !203, file: !204, line: 262, baseType: !208, size: 64, align: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !203, file: !204, line: 264, baseType: !221, size: 64, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !204, line: 160, size: 192, align: 64, elements: !223)
!223 = !{!224, !225, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !222, file: !204, line: 161, baseType: !221, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !222, file: !204, line: 162, baseType: !226, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !222, file: !204, line: 166, baseType: !54, size: 32, align: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !203, file: !204, line: 266, baseType: !226, size: 64, align: 64, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !203, file: !204, line: 268, baseType: !54, size: 32, align: 32, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !203, file: !204, line: 272, baseType: !54, size: 32, align: 32, offset: 928)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !203, file: !204, line: 274, baseType: !232, size: 64, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !233, line: 131, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!234 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !203, file: !204, line: 278, baseType: !236, size: 16, align: 16, offset: 1024)
!236 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !203, file: !204, line: 279, baseType: !238, size: 8, align: 8, offset: 1040)
!238 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !203, file: !204, line: 280, baseType: !240, size: 8, align: 8, offset: 1048)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 8, align: 8, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 1)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !203, file: !204, line: 284, baseType: !244, size: 64, align: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !204, line: 154, baseType: null)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !203, file: !204, line: 293, baseType: !247, size: 64, align: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !233, line: 132, baseType: !234)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !203, file: !204, line: 302, baseType: !4, size: 64, align: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !203, file: !204, line: 303, baseType: !4, size: 64, align: 64, offset: 1280)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !203, file: !204, line: 304, baseType: !4, size: 64, align: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !203, file: !204, line: 305, baseType: !4, size: 64, align: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !203, file: !204, line: 306, baseType: !253, size: 64, align: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !254, line: 62, baseType: !255)
!254 = !DIFile(filename: "/home/mw169/polly/llvm_build/bin/../lib/clang/3.9.0/include/stddef.h", directory: "/home/mw169/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!255 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !203, file: !204, line: 308, baseType: !54, size: 32, align: 32, offset: 1536)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !203, file: !204, line: 310, baseType: !258, size: 160, align: 8, offset: 1568)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 160, align: 8, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 20)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!262 = !DILocalVariable(name: "sys", arg: 1, scope: !197, file: !1, line: 131, type: !200)
!263 = !DILocalVariable(name: "a", arg: 2, scope: !197, file: !1, line: 131, type: !11)
!264 = !DILocalVariable(name: "i", scope: !197, file: !1, line: 132, type: !18)
!265 = !DILocalVariable(name: "width", scope: !197, file: !1, line: 133, type: !18)
!266 = !DILocalVariable(name: "height", scope: !197, file: !1, line: 134, type: !18)
!267 = !DILocalVariable(name: "j", scope: !197, file: !1, line: 135, type: !18)
!268 = !DILocalVariable(name: "_6", scope: !197, file: !1, line: 136, type: !18)
!269 = !DILocalVariable(name: "_7", scope: !197, file: !1, line: 137, type: !18)
!270 = !DILocalVariable(name: "_8", scope: !197, file: !1, line: 138, type: !18)
!271 = !DILocalVariable(name: "_9", scope: !197, file: !1, line: 139, type: !18)
!272 = !DILocalVariable(name: "_10", scope: !197, file: !1, line: 140, type: !4)
!273 = !DILocalVariable(name: "_12", scope: !197, file: !1, line: 141, type: !17)
!274 = !DILocalVariable(name: "_12_size", scope: !197, file: !1, line: 141, type: !18)
!275 = !DILocalVariable(name: "_13", scope: !197, file: !1, line: 142, type: !18)
!276 = !DILocalVariable(name: "_14", scope: !197, file: !1, line: 143, type: !18)
!277 = !DILocalVariable(name: "_15", scope: !197, file: !1, line: 144, type: !18)
!278 = !DILocalVariable(name: "_16", scope: !197, file: !1, line: 145, type: !4)
!279 = !DILocalVariable(name: "_18", scope: !197, file: !1, line: 146, type: !17)
!280 = !DILocalVariable(name: "_18_size", scope: !197, file: !1, line: 146, type: !18)
!281 = !DILocalVariable(name: "_19", scope: !197, file: !1, line: 147, type: !18)
!282 = !DILocalVariable(name: "_20", scope: !197, file: !1, line: 148, type: !18)
!283 = !DILocalVariable(name: "_21", scope: !197, file: !1, line: 149, type: !18)
!284 = !DILocalVariable(name: "_22", scope: !197, file: !1, line: 150, type: !18)
!285 = !DILocalVariable(name: "_23", scope: !197, file: !1, line: 151, type: !4)
!286 = !DILocalVariable(name: "_25", scope: !197, file: !1, line: 152, type: !4)
!287 = !DILocalVariable(name: "_25_size", scope: !197, file: !1, line: 153, type: !18)
!288 = !DILocation(line: 131, column: 22, scope: !197)
!289 = !DILocation(line: 131, column: 35, scope: !197)
!290 = !DILocation(line: 132, column: 12, scope: !197)
!291 = !DILocation(line: 133, column: 12, scope: !197)
!292 = !DILocation(line: 134, column: 12, scope: !197)
!293 = !DILocation(line: 135, column: 12, scope: !197)
!294 = !DILocation(line: 136, column: 12, scope: !197)
!295 = !DILocation(line: 137, column: 12, scope: !197)
!296 = !DILocation(line: 138, column: 12, scope: !197)
!297 = !DILocation(line: 139, column: 12, scope: !197)
!298 = !DILocation(line: 141, column: 2, scope: !197)
!299 = !DILocation(line: 142, column: 12, scope: !197)
!300 = !DILocation(line: 143, column: 12, scope: !197)
!301 = !DILocation(line: 144, column: 12, scope: !197)
!302 = !DILocation(line: 146, column: 2, scope: !197)
!303 = !DILocation(line: 147, column: 12, scope: !197)
!304 = !DILocation(line: 148, column: 12, scope: !197)
!305 = !DILocation(line: 149, column: 12, scope: !197)
!306 = !DILocation(line: 150, column: 12, scope: !197)
!307 = !DILocation(line: 153, column: 12, scope: !197)
!308 = !DILocation(line: 159, column: 10, scope: !197)
!309 = !DILocation(line: 163, column: 10, scope: !197)
!310 = !DILocation(line: 169, column: 7, scope: !311)
!311 = distinct !DILexicalBlock(scope: !312, file: !1, line: 169, column: 6)
