; ModuleID = 'MatrixMult.c'
source_filename = "MatrixMult.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.Matrix = type { i64*, i64, i64, i64 }

@.str = private unnamed_addr constant [2 x i8] c"{\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c" data:\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c" width:\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"%lld\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c" height:\00", align 1
@.str.5 = private unnamed_addr constant [2 x i8] c"}\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [5 x i8] c"fail\00", align 1

; Function Attrs: nounwind uwtable
define %struct.Matrix* @copy_Matrix(%struct.Matrix* %_Matrix) #0 !dbg !6 {
entry:
  %_Matrix.addr = alloca %struct.Matrix*, align 8
  %new_Matrix = alloca %struct.Matrix*, align 8
  store %struct.Matrix* %_Matrix, %struct.Matrix** %_Matrix.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (http://llvm.org/git/clang.git cf7bc8edf8cccb1b5de656c403cb55ad44132e98) (http://llvm.org/git/llvm.git 22706dc4c03305692f494d0e42a6de1050d0ec62)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, subprograms: !5)
!1 = !DIFile(filename: "MatrixMult.c", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !20, !23, !24, !28, !31, !96, !99}
!6 = distinct !DISubprogram(name: "copy_Matrix", scope: !1, file: !1, line: 2, type: !7, isLocal: false, isDefinition: true, scopeLine: 2, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Matrix", file: !11, line: 7, baseType: !12)
!11 = !DIFile(filename: "./MatrixMult.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!12 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 3, size: 256, align: 64, elements: !13)
!13 = !{!14, !17, !18, !19}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !12, file: !11, line: 4, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !12, file: !11, line: 4, baseType: !16, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !12, file: !11, line: 5, baseType: !16, size: 64, align: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !12, file: !11, line: 6, baseType: !16, size: 64, align: 64, offset: 192)
!20 = distinct !DISubprogram(name: "free_Matrix", scope: !1, file: !1, line: 9, type: !21, isLocal: false, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{null, !9}
!23 = distinct !DISubprogram(name: "printf_Matrix", scope: !1, file: !1, line: 13, type: !21, isLocal: false, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!24 = distinct !DISubprogram(name: "matrix", scope: !1, file: !1, line: 23, type: !25, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!25 = !DISubroutineType(types: !26)
!26 = !{!9, !16, !16, !15, !16, !27}
!27 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!28 = distinct !DISubprogram(name: "init", scope: !1, file: !1, line: 42, type: !29, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!29 = !DISubroutineType(types: !30)
!30 = !{!9, !16, !16}
!31 = distinct !DISubprogram(name: "print_mat", scope: !1, file: !1, line: 145, type: !32, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34, !9, !27}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !36, line: 48, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 245, size: 1728, align: 64, elements: !39)
!38 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!39 = !{!40, !42, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !63, !64, !65, !66, !70, !72, !74, !78, !81, !83, !84, !85, !86, !87, !91, !92}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 246, baseType: !41, size: 32, align: 32)
!41 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 251, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 252, baseType: !43, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 253, baseType: !43, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 254, baseType: !43, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 255, baseType: !43, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 256, baseType: !43, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 257, baseType: !43, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 258, baseType: !43, size: 64, align: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 260, baseType: !43, size: 64, align: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 261, baseType: !43, size: 64, align: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 262, baseType: !43, size: 64, align: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 264, baseType: !56, size: 64, align: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 160, size: 192, align: 64, elements: !58)
!58 = !{!59, !60, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !57, file: !38, line: 161, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !57, file: !38, line: 162, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !57, file: !38, line: 166, baseType: !41, size: 32, align: 32, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 266, baseType: !61, size: 64, align: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 268, baseType: !41, size: 32, align: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 272, baseType: !41, size: 32, align: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 274, baseType: !67, size: 64, align: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 131, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!69 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 278, baseType: !71, size: 16, align: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 279, baseType: !73, size: 8, align: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 280, baseType: !75, size: 8, align: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, align: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 284, baseType: !79, size: 64, align: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 154, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 293, baseType: !82, size: 64, align: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 132, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !37, file: !38, line: 302, baseType: !4, size: 64, align: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !37, file: !38, line: 303, baseType: !4, size: 64, align: 64, offset: 1280)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !37, file: !38, line: 304, baseType: !4, size: 64, align: 64, offset: 1344)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !37, file: !38, line: 305, baseType: !4, size: 64, align: 64, offset: 1408)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 306, baseType: !88, size: 64, align: 64, offset: 1472)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 62, baseType: !90)
!89 = !DIFile(filename: "/home/sam/polly/llvm_build/bin/../lib/clang/3.9.0/include/stddef.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/MatrixMult/impl/autogenerate2")
!90 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 308, baseType: !41, size: 32, align: 32, offset: 1536)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 310, baseType: !93, size: 160, align: 8, offset: 1568)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 20)
!96 = distinct !DISubprogram(name: "mat_mult", scope: !1, file: !1, line: 250, type: !97, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!97 = !DISubroutineType(types: !98)
!98 = !{!9, !9, !27, !9, !27}
!99 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 538, type: !100, isLocal: false, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: false, variables: !2)
!100 = !DISubroutineType(types: !101)
!101 = !{!41, !41, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!103 = !{i32 2, !"Dwarf Version", i32 4}
!104 = !{i32 2, !"Debug Info Version", i32 3}
!105 = !{!"clang version 3.9.0 (http://llvm.org/git/clang.git cf7bc8edf8cccb1b5de656c403cb55ad44132e98) (http://llvm.org/git/llvm.git 22706dc4c03305692f494d0e42a6de1050d0ec62)"}
!106 = !DILocalVariable(name: "_Matrix", arg: 1, scope: !6, file: !1, line: 2, type: !9)
!107 = !DIExpression()
!108 = !DILocation(line: 2, column: 29, scope: !6)
!109 = !DILocalVariable(name: "new_Matrix", scope: !6, file: !1, line: 3, type: !9)
!110 = !DILocation(line: 3, column: 10, scope: !6)
!111 = !DILocation(line: 3, column: 23, scope: !6)
!112 = !DILocation(line: 4, column: 2, scope: !6)
!113 = !DILocation(line: 5, column: 22, scope: !6)
!114 = !DILocation(line: 5, column: 31, scope: !6)
!115 = !DILocation(line: 5, column: 2, scope: !6)
!116 = !DILocation(line: 5, column: 14, scope: !6)
!117 = !DILocation(line: 5, column: 20, scope: !6)
!118 = !DILocation(line: 6, column: 23, scope: !6)
!119 = !DILocation(line: 6, column: 32, scope: !6)
!120 = !DILocation(line: 6, column: 2, scope: !6)
!121 = !DILocation(line: 6, column: 14, scope: !6)
!122 = !DILocation(line: 6, column: 21, scope: !6)
!123 = !DILocation(line: 7, column: 9, scope: !6)
!124 = !DILocation(line: 7, column: 2, scope: !6)
!125 = !DILocalVariable(name: "matrix", arg: 1, scope: !20, file: !1, line: 9, type: !9)
!126 = !DILocation(line: 9, column: 26, scope: !20)
!127 = !DILocation(line: 10, column: 7, scope: !20)
!128 = !DILocation(line: 10, column: 15, scope: !20)
!129 = !DILocation(line: 10, column: 2, scope: !20)
!130 = !DILocation(line: 11, column: 7, scope: !20)
!131 = !DILocation(line: 11, column: 2, scope: !20)
!132 = !DILocation(line: 12, column: 1, scope: !20)
!133 = !DILocalVariable(name: "matrix", arg: 1, scope: !23, file: !1, line: 13, type: !9)
!134 = !DILocation(line: 13, column: 28, scope: !23)
!135 = !DILocation(line: 14, column: 2, scope: !23)
!136 = !DILocation(line: 15, column: 2, scope: !23)
!137 = !DILocation(line: 16, column: 2, scope: !23)
!138 = !DILocation(line: 17, column: 2, scope: !23)
!139 = !DILocation(line: 18, column: 17, scope: !23)
!140 = !DILocation(line: 18, column: 25, scope: !23)
!141 = !DILocation(line: 18, column: 2, scope: !23)
!142 = !DILocation(line: 19, column: 2, scope: !23)
!143 = !DILocation(line: 20, column: 17, scope: !23)
!144 = !DILocation(line: 20, column: 25, scope: !23)
!145 = !DILocation(line: 20, column: 2, scope: !23)
!146 = !DILocation(line: 21, column: 2, scope: !23)
!147 = !DILocation(line: 22, column: 1, scope: !23)
!148 = !DILocalVariable(name: "width", arg: 1, scope: !24, file: !1, line: 23, type: !16)
!149 = !DILocation(line: 23, column: 26, scope: !24)
!150 = !DILocalVariable(name: "height", arg: 2, scope: !24, file: !1, line: 23, type: !16)
!151 = !DILocation(line: 23, column: 43, scope: !24)
!152 = !DILocalVariable(name: "data", arg: 3, scope: !24, file: !1, line: 23, type: !15)
!153 = !DILocation(line: 23, column: 51, scope: !24)
!154 = !DILocalVariable(name: "data_size", arg: 4, scope: !24, file: !1, line: 23, type: !16)
