; ModuleID = 'CoinGame.c'
source_filename = "CoinGame.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [5 x i8] c"%lld\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [5 x i8] c"fail\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"%lld\0A\00", align 1

; Function Attrs: nounwind uwtable
define void @play(%struct._IO_FILE* nocapture readnone %sys, i64* nocapture %moves, i64 %moves_size, i1 zeroext %moves_has_ownership, i64 %n) #0 !dbg !6 {
entry:
  tail call void @llvm.dbg.value(metadata %struct._IO_FILE* %sys, i64 0, metadata !75, metadata !257), !dbg !258
  tail call void @llvm.dbg.value(metadata i64* %moves, i64 0, metadata !76, metadata !257), !dbg !259
  tail call void @llvm.dbg.value(metadata i64 %moves_size, i64 0, metadata !77, metadata !257), !dbg !259
  tail call void @llvm.dbg.value(metadata i1 %moves_has_ownership, i64 0, metadata !78, metadata !260), !dbg !261
  tail call void @llvm.dbg.value(metadata i64 %n, i64 0, metadata !79, metadata !257), !dbg !262

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (http://llvm.org/git/clang.git cf7bc8edf8cccb1b5de656c403cb55ad44132e98) (http://llvm.org/git/llvm.git 22706dc4c03305692f494d0e42a6de1050d0ec62)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, subprograms: !5)
!1 = !DIFile(filename: "CoinGame.c", directory: "/home/sam/workspace/WhileyOpenCL/polly/CoinGame/impl/autogenerate")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !148, !211}
!6 = distinct !DISubprogram(name: "play", scope: !1, file: !1, line: 2, type: !7, isLocal: false, isDefinition: true, scopeLine: 2, flags: DIFlagPrototyped, isOptimized: true, variables: !74)
!7 = !DISubroutineType(types: !8)
!8 = !{null, !9, !71, !72, !73, !72}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !11, line: 48, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/CoinGame/impl/autogenerate")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 245, size: 1728, align: 64, elements: !14)
!13 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/CoinGame/impl/autogenerate")
!14 = !{!15, !17, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !59, !60, !61, !62, !66, !67}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !12, file: !13, line: 246, baseType: !16, size: 32, align: 32)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !12, file: !13, line: 251, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !12, file: !13, line: 252, baseType: !18, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !12, file: !13, line: 253, baseType: !18, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !12, file: !13, line: 254, baseType: !18, size: 64, align: 64, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !12, file: !13, line: 255, baseType: !18, size: 64, align: 64, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !12, file: !13, line: 256, baseType: !18, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !12, file: !13, line: 257, baseType: !18, size: 64, align: 64, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !12, file: !13, line: 258, baseType: !18, size: 64, align: 64, offset: 512)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !12, file: !13, line: 260, baseType: !18, size: 64, align: 64, offset: 576)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !12, file: !13, line: 261, baseType: !18, size: 64, align: 64, offset: 640)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !12, file: !13, line: 262, baseType: !18, size: 64, align: 64, offset: 704)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !12, file: !13, line: 264, baseType: !31, size: 64, align: 64, offset: 768)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !13, line: 160, size: 192, align: 64, elements: !33)
!33 = !{!34, !35, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !32, file: !13, line: 161, baseType: !31, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !32, file: !13, line: 162, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !32, file: !13, line: 166, baseType: !16, size: 32, align: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !12, file: !13, line: 266, baseType: !36, size: 64, align: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !12, file: !13, line: 268, baseType: !16, size: 32, align: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !12, file: !13, line: 272, baseType: !16, size: 32, align: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !12, file: !13, line: 274, baseType: !42, size: 64, align: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 131, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/CoinGame/impl/autogenerate")
!44 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !12, file: !13, line: 278, baseType: !46, size: 16, align: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !12, file: !13, line: 279, baseType: !48, size: 8, align: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !12, file: !13, line: 280, baseType: !50, size: 8, align: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, align: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !12, file: !13, line: 284, baseType: !54, size: 64, align: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !13, line: 154, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !12, file: !13, line: 293, baseType: !57, size: 64, align: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 132, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !12, file: !13, line: 302, baseType: !4, size: 64, align: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !12, file: !13, line: 303, baseType: !4, size: 64, align: 64, offset: 1280)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !12, file: !13, line: 304, baseType: !4, size: 64, align: 64, offset: 1344)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !12, file: !13, line: 305, baseType: !4, size: 64, align: 64, offset: 1408)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !12, file: !13, line: 306, baseType: !63, size: 64, align: 64, offset: 1472)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 62, baseType: !65)
!64 = !DIFile(filename: "/home/sam/polly/llvm_build/bin/../lib/clang/3.9.0/include/stddef.h", directory: "/home/sam/workspace/WhileyOpenCL/polly/CoinGame/impl/autogenerate")
!65 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !12, file: !13, line: 308, baseType: !16, size: 32, align: 32, offset: 1536)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !12, file: !13, line: 310, baseType: !68, size: 160, align: 8, offset: 1568)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, align: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 20)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!73 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!75 = !DILocalVariable(name: "sys", arg: 1, scope: !6, file: !1, line: 2, type: !9)
!76 = !DILocalVariable(name: "moves", arg: 2, scope: !6, file: !1, line: 2, type: !71)
!77 = !DILocalVariable(name: "moves_size", arg: 3, scope: !6, file: !1, line: 2, type: !72)
!78 = !DILocalVariable(name: "moves_has_ownership", arg: 4, scope: !6, file: !1, line: 2, type: !73)
!79 = !DILocalVariable(name: "n", arg: 5, scope: !6, file: !1, line: 2, type: !72)
!80 = !DILocalVariable(name: "left", scope: !6, file: !1, line: 3, type: !72)
!81 = !DILocalVariable(name: "right", scope: !6, file: !1, line: 4, type: !72)
!82 = !DILocalVariable(name: "i", scope: !6, file: !1, line: 5, type: !72)
!83 = !DILocalVariable(name: "sum_alice", scope: !6, file: !1, line: 6, type: !72)
!84 = !DILocalVariable(name: "sum_bob", scope: !6, file: !1, line: 7, type: !72)
!85 = !DILocalVariable(name: "coin", scope: !6, file: !1, line: 8, type: !72)
!86 = !DILocalVariable(name: "_9", scope: !6, file: !1, line: 9, type: !72)
!87 = !DILocalVariable(name: "_10", scope: !6, file: !1, line: 10, type: !72)
!88 = !DILocalVariable(name: "_11", scope: !6, file: !1, line: 11, type: !72)
!89 = !DILocalVariable(name: "_12", scope: !6, file: !1, line: 12, type: !72)
!90 = !DILocalVariable(name: "_13", scope: !6, file: !1, line: 13, type: !72)
!91 = !DILocalVariable(name: "_14", scope: !6, file: !1, line: 14, type: !72)
!92 = !DILocalVariable(name: "_15", scope: !6, file: !1, line: 15, type: !72)
!93 = !DILocalVariable(name: "_16", scope: !6, file: !1, line: 16, type: !72)
!94 = !DILocalVariable(name: "_17", scope: !6, file: !1, line: 17, type: !72)
!95 = !DILocalVariable(name: "_18", scope: !6, file: !1, line: 18, type: !72)
!96 = !DILocalVariable(name: "_19", scope: !6, file: !1, line: 19, type: !72)
!97 = !DILocalVariable(name: "_20", scope: !6, file: !1, line: 20, type: !72)
!98 = !DILocalVariable(name: "_21", scope: !6, file: !1, line: 21, type: !72)
!99 = !DILocalVariable(name: "_22", scope: !6, file: !1, line: 22, type: !72)
!100 = !DILocalVariable(name: "_23", scope: !6, file: !1, line: 23, type: !72)
!101 = !DILocalVariable(name: "_24", scope: !6, file: !1, line: 24, type: !72)
!102 = !DILocalVariable(name: "_25", scope: !6, file: !1, line: 25, type: !72)
!103 = !DILocalVariable(name: "_26", scope: !6, file: !1, line: 26, type: !72)
!104 = !DILocalVariable(name: "_27", scope: !6, file: !1, line: 27, type: !72)
!105 = !DILocalVariable(name: "_28", scope: !6, file: !1, line: 28, type: !72)
!106 = !DILocalVariable(name: "_29", scope: !6, file: !1, line: 29, type: !72)
!107 = !DILocalVariable(name: "_30", scope: !6, file: !1, line: 30, type: !72)
!108 = !DILocalVariable(name: "_31", scope: !6, file: !1, line: 31, type: !72)
!109 = !DILocalVariable(name: "_32", scope: !6, file: !1, line: 32, type: !72)
!110 = !DILocalVariable(name: "_33", scope: !6, file: !1, line: 33, type: !4)
!111 = !DILocalVariable(name: "_35", scope: !6, file: !1, line: 34, type: !71)
!112 = !DILocalVariable(name: "_35_size", scope: !6, file: !1, line: 34, type: !72)
